[
    {
        "id": 1,
        "title": "At the Office",
        "text": "Line 48 gives you an error, but you can't figure out what is wrong with it.",
        "choices": [
            {
                "target": 3,
                "text": "Ask Tristan for help"
            },
            {
                "target": 2,
                "text": "Don't ask Tristan for help"
            }
        ]
    },
    {
        "id": 2,
        "title": "At the Office",
        "text": "You try to continue on your own, but this is way above your current knowledge.",
        "choices": [
            {
                "target": 1,
                "text": "Continue"
            }
        ]
    },
    {
        "id": 3,
        "title": "Asked Tristan For Help",
        "text": "Tristan gives you an irritated look, but comes over and explains how he would have solved the problem. You continue to work, but you soon run into more errors. What is this database even built on? Hopes and dreams?",
        "choices": [
            {
                "target": 5,
                "text": "Ask Tristan for help"
            },
            {
                "target": 4,
                "text": "Don't ask Tristan for help"
            }
        ]
    },
    {
        "id": 4,
        "title": "I know this! Or maybe not...",
        "text": "You try to continue on your own, but this is way above your current knowledge.",
        "choices": [
            {
                "target": 5,
                "text": "Ask Tristan for help"
            },
            {
                "target": 4,
                "text": "Don't ask Tristan for help"
            }
        ]
    },
    {
        "id": 5,
        "title": "Asked Tristan For More Help",
        "text": "You take a peek above your monitor to ask Tristan, but he doesn't seem to either see or hear you.",
        "choices": [
            {
                "target": 6,
                "text": "Walk over to his desk"
            },
            {
                "target": 4,
                "text": "Don't ask Tristan for help"
            }
        ]
    },
    {
        "id": 6,
        "title": "Walked Over to Tristan's Desk",
        "text": "You walk over to Tristan's desk and pick your finger on his shoulder to get his attention. He quickly closes down what he had up on his computer. The only thing you managed to spot was the name Kurwenal and a cat. Tristan looks at you, annoyed, but he answers your question. You continue to work. You're curious though. What exactly is 'Kurwenal'?",
        "choices": [
            {
                "target": 7,
                "text": "Investigate further"
            },
            {
                "target": 8,
                "text": "Don't investigate further"
            }
        ]
    },
    {
        "id": 7,
        "title": "Investigated Further",
        "text": "You try to investigate it further, but the files about it on Merkeware's servers seem to be locked.",
        "choices": [
            {
                "target": 9,
                "text": "Ask Tristan about 'Kurwenal'"
            },
            {
                "target": 8,
                "text": "Forget about it"
            }
        ]
    },
    {
        "id": 8,
        "title": "Eh Whatever. It's probably nothing important.",
        "text": "You finish the extremely boring internship and graduate university. You didn't really learn a lot, because Merkeware's code was terribly build, but you did earn a new enemy: Tristan. You're certain you will despise that man for the rest of your life."
    },
    {
        "id": 9,
        "title": "What is 'Kurwenal'?",
        "text": "Tristan tells you to not worry about it. Your work day is now over.",
        "choices": [
            {
                "target": 10,
                "text": "Continue"
            }
        ]
    },
    {
        "id": 10,
        "title": "The Next Day",
        "text": "You are sad becaues of your dog that died  the other day. You had forgotten to register Melot as a pet, and as a punishment, Merkeware Inc. killed him. That's at least what you think. That's what Merkeware does to those who don't obey.",
        "choices": [
            {
                "target": 11,
                "text": "Walk straight to your desk"
            },
            {
                "target": 12,
                "text": "Take a peek at Tristan's computer"
            }
        ]
    },
    {
        "id": 11,
        "title": "Time To Do My Work!",
        "text": "You walk back to your desk and continue with your work",
        "choices": [
            {
                "target": 8,
                "text": "Continue"
            }
        ]
    },
    {
        "id": 12,
        "title": "What Is Tristan Doing?",
        "text": "You spot the same cat as yesterday, as well as an image of... your dog?",
        "choices": [
            {
                "target": 13,
                "text": "Ask Tristan about the image"
            },
            {
                "target": 11,
                "text": "Go to your desk"
            },
            {
                "target": 17,
                "text": "Quietly observe Tristan's work from behind"
            }
        ]
    },
    {
        "id": 13,
        "title": "What is that, Tristan?",
        "text": "Tristan gives you an angry look and minimizes the window. He tells you that it's none of your business.",
        "choices": [
            {
                "target": 15,
                "text": "Insist"
            },
            {
                "target": 14,
                "text": "Accept the answer"
            }
        ]
    },
    {
        "id": 14,
        "title": "Accepted the answer",
        "text": "You can hear Tristan sigh behind you and give you an angry look.",
        "choices": [
            {
                "target": 19,
                "text": "Continue"
            }
        ]
    },
    {
        "id": 15,
        "title": "Insisted More",
        "text": "Tristan tells you it's secret and that you should mind your own business. If you don't, he will call secrutiy on you.",
        "choices": [
            {
                "target": 16,
                "text": "Insist"
            },
            {
                "target": 14,
                "text": "Accept the answer"
            }
        ]
    },
    {
        "id": 16,
        "title": "Too Curious",
        "text": "Tristan calls safety on you, and you are sentenced to a life time in prison for espionage."
    },
    {
        "id": 17,
        "title": "Watching From Behind",
        "text": "Tristan doesn't notice you. He has a report up, which describes the death of your dog in detail. He poisoned your dog.",
        "choices": [
            {
                "target": 19,
                "text": "Go back to your desk"
            },
            {
                "target": 18,
                "text": "Continue to watch Tristan's work"
            }
        ]
    },
    {
        "id": 18,
        "title": "Nothing To See Here",
        "text": "Tristan notices you.",
        "choices": [
            {
                "target": 13,
                "text": "Continue"
            }
        ]
    },
    {
        "id": 19,
        "title": "I Got What I Wanted",
        "text": "You walk back to your desk. You are thinking if you should tell your best friend Brangäne about what you just saw.",
        "choices": [
            {
                "target": 20,
                "text": "Tell Brangäne"
            },
            {
                "target": 25,
                "text": "Don't tell Brangäne"
            }
        ]
    },
    {
        "id": 20,
        "title": "You Won't Believe What Just Happened",
        "text": "You tell Brangäne about what you just saw, and you tell her that you are planning to murder Tristan by giving him a glass of milk, because he is extremely lactose intolerant. She tells you it's an extremely bad idea.",
        "choices": [
            {
                "target": 21,
                "text": "Listen to Brangäne"
            },
            {
                "target": 22,
                "text": "Don't listen to Brangäne"
            }
        ]
    },
    {
        "id": 21,
        "title": "Okay, Maybe It Wasn't Such A Good Idea",
        "text": "You listen to Brangäne's advice. Murder isn't a good idea. Although you now have a deep and burning hate for Tristan, you manage to rein it in and finish your internship. You graduate university, feeling betrayed."
    },
    {
        "id": 22,
        "title": "I Have To Kill Him",
        "text": "You insist that you have to this in order to avenge Melot. You walk to the kitched to prepare the glass of milk. You pour it into an opaque mug with a lid to prevent Tristan from seeing the mug's contents.",
        "choices": [
            {
                "target": 100,
                "text": "Continue"
            }
        ]
    },
    {
        "id": 100,
        "title": "Roll Dice",
        "text": "Roll a D20",
        "choices": [
            {
                "target": 23,
                "text": "Rolled 10 or above - Continue"
            },
            {
                "target": 101,
                "text": "Rolled below 10 - Continue"
            }
        ]
    },
    {
        "id": 101,
        "title": "Rolled Below 10",
        "text": "You rolled below 10",
        "choices": [
            {
                "target": 24,
                "text": "Continue"
            }
        ]
    },
    {
        "id": 23,
        "title": "Noticed Brangäne",
        "text": "You notice that Brangäne too is in the kitchen. She puts back a carton of lactose free milk in the fridge and walks back to her department with a mug that looks exactly like yours. They must be pretty popular.",
        "choices": [
            {
                "target": 24,
                "text": "Continue"
            }
        ]
    },
    {
        "id": 24,
        "title": "Assassination Time",
        "text": "You walk back to the office. You offer the milk to Tristan, and he accepts it without giving it a second thought. You take a seat at your desk again and wait for Tristan's death to come.",
        "choices": [
            {
                "target": 25,
                "text": "Continue",
                "requirement": 20
            },
            {
                "target": 30,
                "text": "Continue",
                "requirement": 25
            }
        ]
    },
    {
        "id": 25,
        "title": "Waiting",
        "text": "You wait for what feels like an eternity, but nothing happens. You start to think about this decision, and realize that maybe you have targeted the wrong person. Maybe it is not Tristan who's the enemy. Maybe it is Merke, whom Tristan probably got his orders from.",
        "choices": [
            {
                "target": 26,
                "text": "Approach Tristan and say sorry"
            }
        ]
    },
    {
        "id": 26,
        "title": "The Realization",
        "text": "You stand up and walk over to Tristan. He thanks you for the lactose free milk.",
        "choices": [
            {
                "target": 26,
                "text": "Continue",
                "requirement": 23
            },
            {
                "target": 29,
                "text": "Continue",
                "requirement": 101
            }
        ]
    },
    {
        "id": 27,
        "title": "The Lactose Free Milk",
        "text": "At first, you are a bit confused as to what exactly Tristan is talking about. Then you remember Brangäne and the lactose free milk in the kitched a bit earlier. She switched out the regular milk for lactose free milk. You tell him that it was no problem.",
        "choices": [
            {
                "target": 28,
                "text": "Continue"
            }
        ]
    },
    {
        "id": 28,
        "title": "A Happy End",
        "text": "Tristan sighs and apologizes for killing Melot. He had no choice, he tells you. You accept the apology and you become friends. You realize that the real enemy is Merkeware Inc. and Tristan decides to quit working at Merkeware Inc. as soon as you have finished your internship. You graduate university, and you have gained a really good friend."
    },
    {
        "id": 29,
        "title": "The Lactose Free Milk?",
        "text": "You look at him, confused. Did you accidentally take lactose free milk instead of regular milk? It doesn't matter now. You were lucky that you didn't kill him. That might have been the biggest mistake in your entire life.",
        "choices": [
            {
                "target": 28,
                "text": "Continue"
            }
        ]
    },
    {
        "id": 30,
        "title": "Waiting",
        "text": "You wait for what feels like an eternity. Suddenly, you hear heavy breaths from the other side of the table, and then a thud. You peek above your monitor and see Tristan lie still on the floor.",
        "choices": [
            {
                "target": 32,
                "text": "Call security"
            },
            {
                "target": 31,
                "text": "Escape"
            }
        ]
    },
    {
        "id": 31,
        "title": "Time To Go!",
        "text": "You realize it might be best to escape before somebody notices that you are there, so you do. You return the other day, and everything is back to normal, just as you had expected. Any trace of Tristan is gone, as usual when somebody within Merkeware dies. You finish your internship, and graduate university with a burning hate for Tristan, but also for Merkeware Inc."
    },
    {
        "id": 32,
        "title": "Called Security",
        "text": "You call security, and within minutes they are there. They examine the body, and the mig. Since you were the only person in the room, you get arrested for the murder, and since your fingerprings were found on the mug, you get sentenced to a lifetime in prison for murder."
    }
]